NextFOAM-2506/tutorials/combustion/PDRFoam/pipeLattice/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outer
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
    }

    ground
    {
        type    nutkWallFunction;
        value   $internalField;
    }

    blockedFaces
    {
        type    zeroGradient;
    }

    mergingFaces
    {
        type    nutkWallFunction;
        value   $internalField;
    }

    wallFaces
    {
        type    nutkWallFunction;
        value   $internalField;
    }

    ySymmetry
    {
        type    symmetryPlane;
    }
}


// ************************************************************************* //
